package lab11.ex1;

//8. Разработать проект, в котором для ввода, вывода и изменения односвязного линейного списка создать следующие методы:
//        а) с использованием цикла:
//        •	ввод с головы createHead();
//        •	ввод с хвоста createTail();
//        •	вывод (возвращается строка, сформированная из элементов списка) toString();
//        •	добавление элемента в начало списка AddFirst();
//        •	добавление элемента в конец списка AddLast();
//        •	вставка элемента в список с указанным номером Insert();
//        •	удаление элемента с головы списка RemoveFirst();
//        •	удаление последнего элемента списка RemoveLast();
//        •	удаление из списка элемента с указанным номером
//        	Remove();
//        б) с использованием рекурсии:
//        •	ввод с головы createHeadRec();
//        •	ввод с хвоста createTailRec();
//        •	вывод (возвращается строка, сформированная из элементов списка) toStringRec().


import lab11.test.Node;

public class Ex8Node {
    public static void main(String[] args) {
        Runnable hello_world = () -> System.out.println("hello world");
    }
}
