
/*
Напишите программу, в которой создается двумерный числовой массив
этот массив заполняется «змейкой»:
сначала первая строка (слева направо),
затем последний столбец (снизу вверх),
вторая строка (слева направо) и так далее.
*/
import java.io.File;
import java.util.Arrays;
import java.util.Scanner;
public class Work_and_Progress {
    public static void main(String[] args) {


        String streng = "EoooeEEp";
        File pop = new File("strengex.txt");
        System.out.println(pop.length());

    }
}
